---
kind: enumMember
id: F:Autodesk.Revit.DB.SpecialType.RetainingWall
enum: Autodesk.Revit.DB.SpecialType
source: html/c4dd5703-709a-729c-7ec5-c7f16c77cf38.htm
---
# Autodesk.Revit.DB.SpecialType.RetainingWall

The special type representing retaining walls.